#+TITLE:emacs lisp 
#+AUTHOR: akinjoker
#+email: asatuoyan@gamil.com
#+INFOJS_OPT: 
#+BABEL: :session *R* :cache yes :results output graphics :exports both :tangle yes 
-----
*** 简介
   1. Emacs Lisp(Lisp Processing)缩写，Lisp语言的核心是列表(List)。在Lisp中每个小括号
代表了list,当执行lisp时，会将列表的第一个元素作为函数名，之后的元素作为参数。
   #+begin_src emacs-lisp
	 (+ 4 (- 5 1))
   #+end_src
   #+RESULTS:
   : 8
   2. 单引号表示不执行后面的元素而直接返回它本身,
   #+begin_src lisp
     '(one two three)
     ;; 此时表达了一个包含三个元素的数组
   #+end_src
   #+begin_src emacs-lisp
	 (org-version)
	 (emacs-version)
   #+end_src
   #+RESULTS:
   : GNU Emacs 28.2 (build 1, x86_64-pc-linux-gnu, GTK+ Version 3.24.35, cairo version 1.16.0)
   :  of 2022-12-20, modified by Debian
#+begin_src emacs-lisp
  '(lisp list has(a list inside of it))
#+end_src
*** Whitespace in Lists
1. 在lisp中以下两种空白的效果是一致的,空白和新行的设计为了人们更容易阅读。但是单词之类
   需要至少一个空白来告诉程序读取时，它们不是一个部分。
   #+begin_src emacs-lisp
     '(this list
            looks like this)
     '(this list look like this)
   #+end_src
   #+RESULTS:
   | this | list | look | like | this |

2. lisp中所有的列表都看起来像这样,除了它们可能更长更复杂。
3. 简单来说，一个列表带括号，字符串带有双引号，符号看起来像一个单词，数字看起来像数字
   在特殊情况下，方括号，点和其它特殊的符号会被使用。
*** message
1. 打印一條信息
2. message打印的信息會帶有雙引號
#+begin_src emacs-lisp
  (message "this buffname is : %s" (buffer-name))
  (message "this line is : %d" fill-column)
  (message "He saw %d %s"
           (- fill-column 32)
           (concat "red "
                   (substring
                    "The quick brown foxes jumped." 16 21) ;取出foxes字符串拼接
                   " leaping."))
#+end_src
#+RESULTS:
: He saw 48 red foxes leaping.

*** 計算
#+begin_src emacs-lisp
  (setq counter 0)
  (setq counter (+ counter 1))
  counter
#+end_src
#+RESULTS:
: 1
** Buffer Name
1. buffer-name the name of the buffer
2. buffer-file-name the name of the file
3. 两个函数的返回如下所示。
   #+begin_src emacs-lisp
     (buffer-name) ;;emacs-lisp.org
     (buffer-file-name)
   #+end_src
   #+RESULTS:
   : /home/akinjoker/study-org/emacs-lisp.org
4. file 和buffer是两个不同的实体，file是存储在你电脑中的信息，
   除非你删除它，否则不会消失。buffer是emacs中的信息，随着emacs
   中对应的会话结束将会消失。除非你将buffer中的信息保存到原本的
   文件中，否则它不会消失。
5. nil是Latin语的nothing，在lisp中也意味着false
6. 小括号可以让中间symbol作为函数所解释
